# Assignment 1: Data Extraction

# Task 1

[link to database](https://www.db-book.com/db7/university-lab-dir/sqlite-tips.html)

| db     | amount |
| -------|:----:|
| tables | 12   |

| Table        | rows |
| ------------ |:----:|
| advisor      | 9    |
| classroom    | 5    |
| course       | 13   |
| department   | 7    |
| instructor   | 12   |
| prereq       | 7    |
| section      | 15   |
| student      | 13   |
| takes        | 22   |
| teaches      | 15   |
| time_slot    | 20   |

# TASK 2

## Q1

### NL
<p>
we would like to know the instructor name and the department he/she works in
first of all we select the relation instructor to left outer join with department where we equal the depart_name keys
so from instructor foreign key depart_name equal department primary key depart_name</p>

### RA
∏ r.name, t.dept_name (Pr(instructor) ⨝ r.dept_name=t.dept_name Pt(department))

### SQL query
select R.name, T.dept_name from instructor R left join department T on R.dept_name=T.dept_name;

# Q2

### NL
first select the table and define the attribute and count operator u would like to count the null values by defining the conditional expression in the where

### RA
∏ ∑num_null_values (Pnum_null_values(σ takes.grade=null (takes)))

### SQL
select count() num_null_values from takes where grade is null;

# Q3

### NL
we would like to now if a student has taken any course
first we query all students taken a course and compare that with the list of all students to get only the
the students who dont have taken a course

### RA
∏ a.ID, a.name, a.dept_name (Pa(student) - (∏ s.ID, s.name, s.dept_name ( σ s.ID=takes.ID Ps(student) X takes)))

### SQL
select a.ID, name, dept_name from student a EXCEPT select s.ID, name, dept_name from student s, takes where s.ID=takes.ID;

# Q4

# NL
we would like to know which departments has only 1 student
first we define a subquery to fetch count of students on each department and then we define the
conditional expression by using a alias n_students equal to 1

### RA
∏ student.dept_name ( σ n_students=1 ( ∑ Pn_students( σ student.dept_name=department.dept_name (student) ) ) (department))

### SQL
select dept_name, (select count() from student
where student.dept_name=department.dept_name) n_students from department where n_students = 1;

# Q5
### NL

### RA

### SQL

# Q6

### NL
we would like to see the max and min (numerical values) of a attribute of a relation

### RA
∏ Pmax_salary(∏ salary (σ instructor)), Pmin_salary(∏ salary (σ instructor))

### SQL
select max(salary) max_salary, min(salary) min_salary from instructor;

# Q7
### NL

### RA
σ x.course_id=c.course_id (Px(course) X Pc(course))

### SQL
select * from course c, course x where c.course_id=x.course_id;

# TASK 3

In [5]:
import sqlite3
import pandas as pd

In [6]:
# Q1

def fetch_table_names(db_conn):
    cur = conn.cursor()
    cur.execute('select DISTINCT tbl_name from ' + 'sqlite_master')
    return cur.fetchall()

def fetch_table_as_df(db_conn, table):
    header_query = "SELECT name FROM pragma_table_info('" + table + "') ORDER BY cid;"
    cols_init = db_conn.cursor().execute(header_query).fetchall()
    cols = [''.join(i) for i in cols_init]
    result = db_conn.cursor().execute('select * from ' + table).fetchall()
    return pd.DataFrame(result, columns=cols)

In [9]:
conn = sqlite3.connect('../data/univdb-sqlite.db')

for table_name in fetch_table_names(conn):
    table = ''.join(table_name)
    fetch_table_as_df(conn, table).to_csv('../csv/'+table)

print('finished gen csv files')

finished gen csv files

In [7]:
# Q2
#
def fetch_table(conn, table_name):
    return fetch_table_as_df(conn, table_name)

In [15]:
# select R.name, T.dept_name from instructor R left join department T on R.dept_name=T.dept_name;
df_instructor = fetch_table(conn, 'instructor')
df_department = fetch_table(conn, 'department')

merged = pd.merge(df_instructor, df_department, left_on='dept_name', right_on='dept_name', how='left')
merged[['name', 'dept_name']]

          name   dept_name
0   Srinivasan  Comp. Sci.
1           Wu     Finance
2       Mozart       Music
3     Einstein     Physics
4      El Said     History
5         Gold     Physics
6         Katz  Comp. Sci.
7    Califieri     History
8        Singh     Finance
9        Crick     Biology
10      Brandt  Comp. Sci.
11         Kim  Elec. Eng.

In [20]:
# select count() num_null_values from takes where grade is null;
df_takes = fetch_table(conn, 'takes')
n_null_values = len(df_takes[df_takes['grade'].isna()])
print(f'num null values: {n_null_values}')

num null values: 1

In [77]:
# select dept_name, (select count() from student
# where student.dept_name=department.dept_name) n_students from department where n_students = 1;
import numpy as np
df_student = fetch_table(conn, 'student')
aggregated = pd.merge(df_department, df_student, on='dept_name').groupby('dept_name').size()
aggregated[aggregated == 1]

dept_name
Biology    1
Finance    1
History    1
Music      1
dtype: int64

In [78]:
# group by on category
df_student.groupby('dept_name').size()

dept_name
Biology       1
Comp. Sci.    4
Elec. Eng.    2
Finance       1
History       1
Music         1
Physics       3
dtype: int64

In [101]:
# select max(salary) max_salary, min(salary) min_salary from instructor;

df_instructor.agg(max_salary=('salary', np.max), min_salary=('salary', np.min)).T

        max_salary  min_salary
salary       95000       40000

In [106]:
# select * from course c, course x where c.course_id=x.course_id;

df_course = fetch_table(conn, 'course')
pd.merge(df_course, df_course, on='course_id')

,course_id,title_x,dept_name_x,credits_x,title_y,dept_name_y,credits_y
0,BIO-101,Intro. to Biology,Biology,4,Intro. to Biology,Biology,4
1,BIO-301,Genetics,Biology,4,Genetics,Biology,4
2,BIO-399,Computational Biology,Biology,3,Computational Biology,Biology,3
3,CS-101,Intro. to Computer Science,Comp. Sci.,4,Intro. to Computer Science,Comp. Sci.,4
4,CS-190,Game Design,Comp. Sci.,4,Game Design,Comp. Sci.,4
5,CS-315,Robotics,Comp. Sci.,3,Robotics,Comp. Sci.,3
6,CS-319,Image Processing,Comp. Sci.,3,Image Processing,Comp. Sci.,3
7,CS-347,Database System Concepts,Comp. Sci.,3,Database System Concepts,Comp. Sci.,3
8,EE-181,Intro. to Digital Systems,Elec. Eng.,3,Intro. to Digital Systems,Elec. Eng.,3
9,FIN-201,Investment Banking,Finance,3,Investment Banking,Finance,3
10,HIS-351,World History,History,3,World History,History,3
11,MU-199,Music Video Production,Music,3,Music Video Production,Music,3
12,PHY-101,Physical Principles,Physics,4,Physical Principles,Physics,4

In [44]:
# Task 4

In [45]:
# Q1
# A
# B
# ∏: A projection is basically a set of attributes which u would like to have in a the returned relation
# ⨝: A join is a Cartesian Product of 2 or more relations reflected as 1 relation joined on their superkeys
# -: A difference returns a relation where the left relation doesnt match the right relation

In [46]:
# Q2
# (X ^ Y)
# (X ^ Y)
# (X ^ Y)
# ~(X ^ Y)

In [ ]:
# Q3